
const allCountries=[
    {
      "Страна": "Абхазия",
      "Столица": "Сухум",
      "Континент": "Азия"
    },
    {
      "Страна": "Австралия",
      "Столица": "Канберра",
      "Континент": "Австралия и Океания"
    },
    {
      "Страна": "Австрия",
      "Столица": "Вена",
      "Континент": "Европа"
    },
    {
      "Страна": "Азербайджан",
      "Столица": "Баку",
      "Континент": "Азия"
    },
    {
      "Страна": "Албания",
      "Столица": "Тирана",
      "Континент": "Европа"
    },
    {
      "Страна": "Алжир",
      "Столица": "Алжир",
      "Континент": "Африка"
    },
    {
      "Страна": "Ангола",
      "Столица": "Луанда",
      "Континент": "Африка"
    },
{
      "Страна": "Россия",
      "Столица": "Москва",
      "Континент": "Европа"
},
      {
      "Страна": "Египет",
      "Столица": "Каир",
      "Континент": "Африка"
    },
      {
      "Страна": "Замбия",
      "Столица": "Лусака",
      "Континент": "Африка"
    },
      {
      "Страна": "Камерун",
      "Столица": "Яунде",
      "Континент": "Африка"
    },
     {
      "Страна": "Лесото",
      "Столица": "Масеру",
      "Континент": "Африка"
},



    //Приходько Влад:
    {
      "Страна": "Норвегия",
      "Столица": "Осло",
      "Площадь": "385 207",
      "Население": "5 520 000",
      "Континент": "Европа"
    },
    {
      "Страна": "Финляндия",
      "Столица": "Хельсинки",
      "Площадь": "338 462",
      "Население": "5 584 000",
      "Континент": "Европа"
    },
    {
      "Страна": "Швеция",
      "Столица": "Стокгольм",
      "Площадь": "450 295",
      "Население": "10 540 000",
      "Континент": "Европа"

    }
  ]

  let countries = allCountries.filter(country =>  country.Континент);
