
const allCountries=[
    {
      "Страна": "Абхазия",
      "Столица": "Сухум",
      "Континент": "Азия"
    },
    {
      "Страна": "Австралия",
      "Столица": "Канберра",
      "Континент": "Австралия и Океания"
    },
    {
      "Страна": "Австрия",
      "Столица": "Вена",
      "Континент": "Европа"
    },
    {
      "Страна": "Азербайджан",
      "Столица": "Баку",
      "Континент": "Азия"
    },
    {
      "Страна": "Албания",
      "Столица": "Тирана",
      "Континент": "Европа"
    },
    {
      "Страна": "Алжир",
      "Столица": "Алжир",
      "Континент": "Африка"
    },
    {
      "Страна": "Ангола",
      "Столица": "Луанда",
      "Континент": "Африка"
    },
{
      "Страна": "Россия",
      "Столица": "Москва",
      "Континент": "Европа"
}
  ]

  let countries = allCountries.filter(country =>  country.Континент);
