
const allCountries=[
    {
      "Страна": "Абхазия",
      "Столица": "Сухум",
      "Площадь": "8 600",
      "Население": "243 564",
      "Континент": "Азия"
    },
    {
      "Страна": "Австралия",
      "Столица": "Канберра",
      "Площадь": "7 686 850",
      "Население": "24 238 610",
      "Континент": "Австралия и Океания"
    },
    {
      "Страна": "Австрия",
      "Столица": "Вена",
      "Площадь": "83 858",
      "Население": "8 741 753",
      "Континент": "Европа"
    },
    {
      "Страна": "Азербайджан",
      "Столица": "Баку",
      "Площадь": "86 600",
      "Население": "9 705 600",
      "Континент": "Азия"
    },
    {
      "Страна": "Албания",
      "Столица": "Тирана",
      "Площадь": "28 748",
      "Население": "2 866 026",
      "Континент": "Европа"
    },
    {
      "Страна": "Алжир",
      "Столица": "Алжир",
      "Площадь": "2 381 740",
      "Население": "39 813 722",
      "Континент": "Африка"
    },
    {
      "Страна": "Ангола",
      "Столица": "Луанда",
      "Площадь": "1 246 700",
      "Население": "25 831 000",
      "Континент": "Африка"
    },
{
      "Страна": "Россия",
      "Столица": "Москва",
      "Площадь": "10000000",
      "Население": "10000",
      "Континент": "Европа"
}
  ]

  let countries = allCountries.filter(country =>  country.Континент);