
const allCountries=[
    {
      "Страна": "Абхазия",
      "Столица": "Сухум",
      "Континент": "Азия"
    },
    {
      "Страна": "Австралия",
      "Столица": "Канберра",
      "Континент": "Австралия и Океания"
    },
    {
      "Страна": "Австрия",
      "Столица": "Вена",
      "Континент": "Европа"
    },
    {
      "Страна": "Азербайджан",
      "Столица": "Баку",
      "Континент": "Азия"
    },
    {
      "Страна": "Албания",
      "Столица": "Тирана",
      "Континент": "Европа"
    },
    {
      "Страна": "Алжир",
      "Столица": "Алжир",
      "Континент": "Африка"
    },
    {
      "Страна": "Ангола",
      "Столица": "Луанда",
      "Континент": "Африка"
    },
{
      "Страна": "Россия",
      "Столица": "Москва",
      "Континент": "Европа"
},
      {
      "Страна": "Египет",
      "Столица": "Каир",
      "Континент": "Африка"
    },
      {
      "Страна": "Замбия",
      "Столица": "Лусака",
      "Континент": "Африка"
    },
      {
      "Страна": "Камерун",
      "Столица": "Яунде",
      "Континент": "Африка"
    },
     {
      "Страна": "Лесото",
      "Столица": "Масеру",
      "Континент": "Африка"
    }
  ]

  let countries = allCountries.filter(country =>  country.Континент);
